'use strict';

import * as core from './view-core';
import * as util from './view-util';

//-----------------------------------------------------------------------------
// HTML要素ID
//-----------------------------------------------------------------------------
{{#view-elements}}
const ID_{{id-descriptor}} = "{{id-value}}";
{{/view-elements}}

//-----------------------------------------------------------------------------
// HTML要素表示
//-----------------------------------------------------------------------------

// 全体を描画
export function renderAll(state) {
{{#view-elements}}
    render{{name}}(state);
{{/view-elements}}
    return null;
}

{{#view-elements}}
// {{comment}}を描画
export function render{{name}}(state) {
{{view-code}}
}

{{/view-elements}}

//-----------------------------------------------------------------------------
// HTML要素値取得
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// 内部関数
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// HTML要素とアクションのバインド
//-----------------------------------------------------------------------------

{{#view-elements}}
// {{comment}}をバインド
export function bind{{name}}(actionCreator) {
    return util.bind(ID_{{id-descriptor}}, "{{event}}", actionCreator);
}

{{/view-elements}}
